from scipy import stats
import matplotlib.pyplot as mpl


def mean(vb):
    return sum(vb) / len(vb)


def median(vb):
    n = len(vb)
    sorted_vb = sorted(vb)
    if n % 2:
        return sorted_vb[n // 2]
    else:
        return (sorted_vb[n // 2 - 1] + sorted_vb[n // 2]) / 2


def dispersion(vb):
    n = len(vb)
    mu = mean(vb)
    s = 0
    for x in vb:
        s += (x - mu) ** 2
    return s / (n - 1)


def standard_deviation(vb):
    return dispersion(vb) ** 0.5


# Статистичний критерій
def z0(vb1, vb2):

    n1 = len(vb1)
    mean1 = mean(vb1)
    dispersion1 = dispersion(vb1)

    n2 = len(vb2)
    mean2 = mean(vb2)
    dispersion2 = dispersion(vb2)

    return (mean1 - mean2) / (dispersion1 / n1 + dispersion2 / n2) ** 0.5


def is_mean_equal(vb1, vb2, a):
    z = z0(vb1, vb2)
    p = 2 * (1 - stats.norm.cdf(abs(z)))
    return p > a, p


def histogram(vb, title):
    mpl.hist(vb)
    mpl.title(title)
    mpl.show()


def main():
    # Початкові параметри
    n1 = 116
    n2 = 144
    mu = 13
    sg = 1.8
    mu1 = mu2 = mu
    sg1 = sg2 = sg
    a = 0.05
    # Перша вибірка
    vb1 = [12.27816, 12.15366, 15.88596, 11.95686, 12.17434, 13.82862,
           14.90101, 11.37559, 11.5214, 11.6702, 11.95669, 14.39612,
           13.50754, 10.45354, 10.76052, 14.57833, 11.03485, 14.16692,
           14.49967, 13.0017, 14.19868, 16.6486, 10.86944, 11.75759,
           15.61061, 14.0761, 10.5409, 14.02879, 13.07667, 14.33123,
           12.34403, 13.00842, 11.06767, 14.18633, 15.1593, 13.91185,
           12.51552, 11.13662, 11.32132, 14.84005, 11.144, 14.03061,
           12.54765, 15.14238, 12.50902, 10.06088, 12.74603, 9.81309,
           11.11947, 16.26702, 13.40376, 9.38822, 10.22455, 15.96005,
           7.98977, 6.80778, 14.99898, 11.1842, 10.09895, 11.55531,
           14.54123, 14.90917, 12.58938, 10.92699, 16.8634, 12.04353,
           11.5272, 12.72024, 15.13592, 12.48717, 12.96815, 14.14767,
           13.01646, 14.56555, 11.32986, 14.33942, 15.2374, 12.63011,
           12.8266, 13.23425, 14.22627, 12.06982, 9.84369, 13.31976,
           9.49942, 13.25648, 9.65056, 8.66618, 11.33168, 12.99319,
           11.29989, 13.35657, 14.06483, 11.64922, 11.29714, 8.41576,
           11.00771, 10.41216, 13.70607, 11.86658, 10.87025, 11.09778,
           15.60888, 13.02493, 13.79041, 11.86227, 11.95769, 10.69338,
           14.44965, 12.33197, 14.54608, 15.19133, 14.3612, 12.22671,
           13.68549, 15.91059]
    # Друга вибірка
    vb2 = [11.69588, 12.54377, 13.39094, 16.81213, 14.84501, 13.9933,
           16.71935, 11.89851, 13.85531, 15.6948, 11.63885, 12.93524,
           12.73524, 14.0698, 14.27858, 13.92806, 11.53895, 13.16285,
           12.83909, 13.01217, 14.22365, 11.87147, 16.78082, 9.41007,
           12.91225, 14.34402, 11.77643, 13.29761, 12.80272, 11.83975,
           10.53157, 13.93681, 16.90607, 11.62919, 14.14601, 13.61269,
           10.20884, 10.64239, 12.16803, 14.30861, 12.66117, 10.73049,
           10.73058, 13.3003, 14.39969, 9.41441, 9.16426, 10.63848, 15.41265,
           12.17258, 11.42416, 11.09785, 10.97295, 10.08541, 10.64375,
           14.36486, 11.57169, 9.20538, 14.11944, 11.28019, 12.09882,
           8.69228, 12.83372, 10.89933, 16.53633, 15.14913, 12.70725,
           13.2295, 15.87023, 9.97763, 13.78176, 15.67789, 14.49177,
           14.75174, 10.40402, 13.70367, 13.17757, 9.27821, 9.73657,
           13.63902, 11.55707, 15.19228, 13.92654, 13.53555, 11.93913,
           12.68971, 13.02959, 12.26026, 13.68355, 14.4004, 12.80244,
           12.17434, 12.41055, 11.98765, 14.17542, 12.41959, 8.4542, 13.14522,
           12.69842, 14.01613, 16.92696, 13.02287, 11.62463, 13.29804, 11.74466,
           12.19936, 12.51407, 12.97362, 13.27457, 13.12119, 12.11648, 13.93189,
           12.63172, 11.70915, 12.95085, 15.7824, 13.59093, 14.87001, 11.95367,
           15.57213, 11.87255, 15.36253, 11.96729, 15.11543, 14.13047, 16.38101,
           12.83276, 14.47836, 7.72322, 12.2341, 16.22102, 12.9909, 17.73436,
           12.91911, 13.99439, 12.17628, 15.51781, 11.49417, 12.4935, 11.89222,
           12.21643, 12.47284, 11.57309, 15.51829]

    print("Результати:")

    print("Вибіркове середнє першої вибірки", mean(vb1))
    print("Вибіркове середнє другої вибірки", mean(vb2))

    print("Медіана першої вибірки", median(vb1))
    print("Медіана другої вибірки", median(vb2))

    print("Дисперсія першої вибірки:", dispersion(vb1))
    print("Дисперсія другої вибірки:", dispersion(vb2))

    print("середньоквадратичне відхилення першої вибірки:", standard_deviation(vb1))
    print("середньоквадратичне відхилення другої вибірки:", standard_deviation(vb2))

    print("Статистичний критерій гіпотези щодо рівності математичних сподівань двох генеральних сукупностей", z0(vb1, vb2))

    is_equal, p = is_mean_equal(vb1, vb2, a)
    if is_equal:
        conclusion = "приймаємо нульову гіпотезу."
    else:
        conclusion = "відхиляємо нульову гіпотезу"

    print("Оскільки p = {}, то {}".format(p, conclusion))

    histogram(vb1, "Перша вибірка")
    histogram(vb2, "Друга вибірка")


main()
